/*==================================
  ■■■ 클래스와 인스턴스 ■■■
===================================*/

// 직사각형 클래스 설계

/*
· 내용 : 직사각형의 넓이와 둘레를 계산, 클래스로 표현.
· 클래스의 정체성 → 직사각형
· 클래스의 속성 → 가로, 세로 ( 넓이, 둘레, 무게, 색상, 재질, ..... )
· 클래스의 기능 → 넓이 계산, 둘레 계산, 가로/세로 입력, 결과 출력


※ 객체를 구성 → 데이터(속성, 상태) + 기능(행위, 동작)
      |
	  | 설계도	  ------------------	--------------
	  |
   클래스를 구성 →		 변수 				메소드 

// 하나의 파일에 여러 개의 클래스를 설계하는 것은 가능하다.
// 여러 개의 클래스 중 'public'이라는 '접근지시자'를 붙일 수 있는 건 오로지 하나만 가능하다.
   cf. main() 의 여부와 상관없음
*/

class Rect // 직사각형 클래스 설계
{
}






public class Test070
{
	public static void main(String[] args)
	{
		
	}
}
